# GetPolyloops Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisSurface..::..GetPolyloops Method
EnergyAnalysisSurface Class See Also
---
Gets the collection of planar polygons describing the surface geometry.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public IList<Polyloop> GetPolyloops()
```

Visual Basic
---
```text
Public Function GetPolyloops As IList(Of Polyloop)
```

Visual C++
---
```text
public:
IList<Polyloop^>^ GetPolyloops()
```

# ### Return Value
The collection of polygons describing the surface geometry.
# Remarks
A collection of polyloops (planar polygons) describing the surface geometry as described in gbXML. The geometry is currently measured per analytical(center-line).
# See Also
EnergyAnalysisSurface Class
Autodesk.Revit.DB.Analysis Namespace